src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыОрганизаций/ТипыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОрганизаций</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Организации/ObjectModule.bsl
// Модуль объекта справочника "Организации".
// Содержит проверки, выполняемые перед записью элемента.

#Область ОбработчикиСобытий

// Обработчик события "ПередЗаписью".
// Выполняет валидацию ИНН:
//   - ИНН должен состоять только из цифр (без букв, пробелов и прочих символов);
//   - для юридического лица – ровно 10 цифр;
//   - для индивидуального предпринимателя – ровно 12 цифр.
// Если ИНН не заполнен, проверка не производится (пустая строка допустима).
// При любом несоответствии запись блокируется.
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЦифр = "0123456789";
	Для Сч = 1 По СтрДлина(ИНН) Цикл
		Символ = Сред(ИНН, Сч, 1);
		Если СтрНайти(СтрокаЦифр, Символ) = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка: ИНН должен содержать только цифры. Обнаружен недопустимый символ: '" + Символ + "'.";
			Сообщение.Поле = "ИНН";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо Тогда
		Если СтрДлина(ИНН) <> 10 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка: для юридического лица ИНН должен содержать 10 цифр. Введено " + СтрДлина(ИНН)
				+ " символов.";
			Сообщение.Поле = "ИНН";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ТипОрганизации = Перечисления.ТипыОрганизаций.ИндивидуальныйПредприниматель Тогда
		Если СтрДлина(ИНН) <> 12 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка: для индивидуального предпринимателя ИНН должен содержать 12 цифр. Введено " + СтрДлина(
				ИНН) + " символов.";
			Сообщение.Поле = "ИНН";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
